#### Write a program which will find all such numbers which are divisible by 7 but are not a multiple of 5, between 2000 and 3200 (both included).The numbers obtained should be printed in a comma-separated sequence on a single line

In [8]:
a=[]
for i in range(2000, 3201):
    if (i%7==0) & (i%5!=0):
        a.append(str(i))
print(','.join(a))

2002,2009,2016,2023,2037,2044,2051,2058,2072,2079,2086,2093,2107,2114,2121,2128,2142,2149,2156,2163,2177,2184,2191,2198,2212,2219,2226,2233,2247,2254,2261,2268,2282,2289,2296,2303,2317,2324,2331,2338,2352,2359,2366,2373,2387,2394,2401,2408,2422,2429,2436,2443,2457,2464,2471,2478,2492,2499,2506,2513,2527,2534,2541,2548,2562,2569,2576,2583,2597,2604,2611,2618,2632,2639,2646,2653,2667,2674,2681,2688,2702,2709,2716,2723,2737,2744,2751,2758,2772,2779,2786,2793,2807,2814,2821,2828,2842,2849,2856,2863,2877,2884,2891,2898,2912,2919,2926,2933,2947,2954,2961,2968,2982,2989,2996,3003,3017,3024,3031,3038,3052,3059,3066,3073,3087,3094,3101,3108,3122,3129,3136,3143,3157,3164,3171,3178,3192,3199

In [ ]:
FirstName=input("Enter your First Name:")
LastName=input("Enter Your Last Name:")
print(LastName+" "+ FirstName)

In [ ]:
diameter=12
r=diameter/2
pi=3.14
Volume=4/3*pi*r**3
print("Volume of the sphere is", Volume)

In [ ]:
a=5;
for i in range(a):
    for j in range(i):
        print ('* ', end="")
    print('')

for i in range(a,0,-1):
    for j in range(i):
        print('* ', end="")
    print('')

In [ ]:
a= 'ineuron'
a[::-1]

In [1]:
def myreduce(func, my_list):
    result = my_list[0]
    for i in my_list[1:]:
        result = func(result, item)
        return result

In [2]:
def sum(x,y): return x + y

In [3]:
sum(3,5)

8

In [4]:
def myfilter(func, my_list): 
    result=[]
    for i in my_list:
        if func(i): 
            result.append(i)
    return result

In [5]:
def ispositive(x):
    if (x <= 0): 
        return False 
    else: 
        return True

In [6]:
ispositive(3)

True

In [7]:
ispositive(-3)

False

In [8]:
ispositive(0)

False

In [10]:


input_list = ['x','y','z']
result = [ item*num for item in input_list for num in range(1,5)  ]
print("['x','y','z'] = " +   str(result))


input_list = ['x','y','z']
result = [ item*num for num in range(1,5) for item in input_list  ]
print("['x','y','z'] = " +   str(result))


input_list = [2,3,4]
result = [ [item+num] for item in input_list for num in range(0,3)]
print("[2,3,4] =" +  str(result))

input_list = [2,3,4,5]
result = [ [item+num for item in input_list] for num in range(0,4)  ]
print("[2,3,4,5] =" +  str(result))


input_list=[1,2,3]
result = [ (b,a) for a in input_list for b in input_list]
print("[1,2,3] =" +  str(result))

['x','y','z'] => ['x', 'xx', 'xxx', 'xxxx', 'y', 'yy', 'yyy', 'yyyy', 'z', 'zz', 'zzz', 'zzzz']
['x','y','z'] => ['x', 'y', 'z', 'xx', 'yy', 'zz', 'xxx', 'yyy', 'zzz', 'xxxx', 'yyyy', 'zzzz']
[2,3,4] =>[[2], [3], [4], [3], [4], [5], [4], [5], [6]]
[2,3,4,5] =>[[2, 3, 4, 5], [3, 4, 5, 6], [4, 5, 6, 7], [5, 6, 7, 8]]
[1,2,3] =>[(1, 1), (2, 1), (3, 1), (1, 2), (2, 2), (3, 2), (1, 3), (2, 3), (3, 3)]

In [14]:


input_list = ['x','y','z']
result = [ item*num for item in input_list for num in range(1,5)  ]
print(  str(result))


input_list = ['x','y','z']
result = [ item*num for num in range(1,5) for item in input_list  ]
print(   str(result))


input_list = [2,3,4]
result = [ [item+num] for item in input_list for num in range(0,3)]
print(  str(result))

input_list = [2,3,4,5]
result = [ [item+num for item in input_list] for num in range(0,4)  ]
print( str(result))


input_list=[1,2,3]
result = [ (b,a) for a in input_list for b in input_list]
print(  str(result))

['x', 'xx', 'xxx', 'xxxx', 'y', 'yy', 'yyy', 'yyyy', 'z', 'zz', 'zzz', 'zzzz']
['x', 'y', 'z', 'xx', 'yy', 'zz', 'xxx', 'yyy', 'zzz', 'xxxx', 'yyyy', 'zzzz']
[[2], [3], [4], [3], [4], [5], [4], [5], [6]]
[[2, 3, 4, 5], [3, 4, 5, 6], [4, 5, 6, 7], [5, 6, 7, 8]]
[(1, 1), (2, 1), (3, 1), (1, 2), (2, 2), (3, 2), (1, 3), (2, 3), (3, 3)]

In [15]:
a = float(input('Enter a: '))
b = float(input('Enter b: '))
c = float(input('Enter c: '))
 

s = (a + b + c) / 2
 

Area = (s*(s-a)*(s-b)*(s-c)) ** 0.5
 
print(" The Area of a Triangle is %0.2f" %Area)

Enter a: 2
Enter b: 3
Enter c: 4
 The Area of a Triangle is 2.90

In [17]:
def long_words(n, str):  
    word_len = []  
    txt = str.split(" ")  
    for x in txt:  
        if len(x) > n:  
            word_len.append(x)  
    return word_len   
print(long_words(3, "India is my Country "))

['India', 'Country']

In [20]:
listOfWords = ['ab','cde','erty']
 
listOfInts = []
 
for i in range(len(listOfWords)):
    listOfInts.append(len(listOfWords[i]))
 
print ("List of words:"+str(listOfWords))    
print ("List of word length:"+str(listOfInts))

List of words:['ab', 'cde', 'erty']
List of word length:[2, 3, 4]

In [21]:
def is_vowel(char):
    all_vowels = 'aeiou'
    return char in all_vowels

In [22]:
print(is_vowel('f'))

False

In [23]:
print(is_vowel('u'))

True

In [5]:
try:
   a= 5/0
except:
    print("Invalid entry")

Invalid entry

In [6]:
def divide(a,b):
    try:
        c=a/b
        print("the answer is ",c)
    except:
        print("The number is not divisible: Division by Zero")

In [8]:
divide(3,5)

the answer is  0.6

In [9]:
divide(5,0)

The number is not divisible: Division by Zero

In [22]:
subjects=["Americans ","Indians"] 
verbs=["play","watch"] 
objects= ["Baseball","Cricket"]
print(subjects[0]+verbs[0]+ " "+objects[0]+".")
print(subjects[0]+verbs[0]+ " "+objects[1]+".")
print(subjects[0]+verbs[1]+ " "+objects[0]+".")
print(subjects[0]+verbs[1]+ " "+objects[1]+".")

print(subjects[1]+" "+verbs[0]+ " "+objects[0]+".")
print(subjects[1]+" "+verbs[0]+ " "+objects[1]+".")
print(subjects[1]+" "+verbs[1]+ " "+objects[0]+".")
print(subjects[1]+" "+verbs[1]+ " "+objects[1]+".")

Americans play Baseball.
Americans play Cricket.
Americans watch Baseball.
Americans watch Cricket.
Indians play Baseball.
Indians play Cricket.
Indians watch Baseball.
Indians watch Cricket.

In [2]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
 
'Budapest_PaRis', 'Brussels_londOn'], 
 
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
 
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
 
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
 
'12. Air France', '"Swiss Air"']})

df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [3]:
df.dtypes['FlightNumber']

dtype('float64')

In [4]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)

df['FlightNumber']

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

In [5]:
Z = df["From_To"].str.split('_', expand=True)
Z.columns = ['From', 'To']

Z

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [10]:
Z['From'] = Z['From'].str.capitalize()
Z['To'] = Z['To'].str.capitalize()

Z

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [14]:
df=df.drop("From_To",axis=1)
df=df.join(Z)
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [15]:
delays = df['RecentDelays'].apply(pd.Series)
delays.columns = ['delay_{}'.format(n) for n in range(1, len(delays.columns)+1)]
df = df.drop('RecentDelays', axis=1).join(delays)
df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN